vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32h503/DMA_registers.h
/* This file is generated by stm32_reggen.py from stm32h503xx.h
 * Do not edit this file manually!
 * If corrections are needed, use the
 * override mechanism(s) defined to modify the parsed results
 * and re-run the script to update the file.
 *
 * This file contains the DMA register type definitions for the stm32h503 series of chips.
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "DMA_index.h"


typedef union {
	struct {
		uint32_t PRIV0         : 1; // /*!< Privileged State of Channel 0  */
		uint32_t PRIV1         : 1; // /*!< Privileged State of Channel 1  */
		uint32_t PRIV2         : 1; // /*!< Privileged State of Channel 2  */
		uint32_t PRIV3         : 1; // /*!< Privileged State of Channel 3  */
		uint32_t PRIV4         : 1; // /*!< Privileged State of Channel 4  */
		uint32_t PRIV5         : 1; // /*!< Privileged State of Channel 5  */
		uint32_t PRIV6         : 1; // /*!< Privileged State of Channel 6  */
		uint32_t PRIV7         : 1; // /*!< Privileged State of Channel 7  */
		uint32_t _reserved8    :24;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_dma,privcfgr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_dma,privcfgr),bits);

typedef union {
	struct {
		uint32_t MIS0          : 1; // /*!< Masked Interrupt State of Non-Secure Channel 0  */
		uint32_t MIS1          : 1; // /*!< Masked Interrupt State of Non-Secure Channel 1  */
		uint32_t MIS2          : 1; // /*!< Masked Interrupt State of Non-Secure Channel 2  */
		uint32_t MIS3          : 1; // /*!< Masked Interrupt State of Non-Secure Channel 3  */
		uint32_t MIS4          : 1; // /*!< Masked Interrupt State of Non-Secure Channel 4  */
		uint32_t MIS5          : 1; // /*!< Masked Interrupt State of Non-Secure Channel 5  */
		uint32_t MIS6          : 1; // /*!< Masked Interrupt State of Non-Secure Channel 6  */
		uint32_t MIS7          : 1; // /*!< Masked Interrupt State of Non-Secure Channel 7  */
		uint32_t _reserved8    :24;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_dma,misr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_dma,misr),bits);

typedef union {
	struct {
		uint32_t _reserved0    :16;
		uint32_t LBA           :16; // /*!< Linked-list Base Address of DMA channel x */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_dma,clbar);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_dma,clbar),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 8;
		uint32_t TCF           : 1; // /*!< Transfer complete flag clear             */
		uint32_t HTF           : 1; // /*!< Half transfer complete flag clear        */
		uint32_t DTEF          : 1; // /*!< Data transfer error flag clear           */
		uint32_t ULEF          : 1; // /*!< Update linked-list item error flag clear */
		uint32_t USEF          : 1; // /*!< User setting error flag clear            */
		uint32_t SUSPF         : 1; // /*!< Completed suspension flag clear          */
		uint32_t TOF           : 1; // /*!< Trigger overrun flag clear               */
		uint32_t _reserved15   :17;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_dma,cfcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_dma,cfcr),bits);

typedef union {
	struct {
		uint32_t IDLEF         : 1; // /*!< Idle flag                          */
		uint32_t _reserved1    : 7;
		uint32_t TCF           : 1; // /*!< Transfer complete flag             */
		uint32_t HTF           : 1; // /*!< Half transfer complete flag        */
		uint32_t DTEF          : 1; // /*!< Data transfer error flag           */
		uint32_t ULEF          : 1; // /*!< Update linked-list item error flag */
		uint32_t USEF          : 1; // /*!< User setting error flag            */
		uint32_t SUSPF         : 1; // /*!< User setting error flag            */
		uint32_t TOF           : 1; // /*!< Trigger overrun flag               */
		uint32_t _reserved15   : 1;
		uint32_t FIFOL         : 8; // /*!< Monitored FIFO level in bytes      */
		uint32_t _reserved24   : 8;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_dma,csr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_dma,csr),bits);

typedef union {
	struct {
		uint32_t EN            : 1; // /*!< Channel enable                                 */
		uint32_t RESET         : 1; // /*!< Channel reset                                  */
		uint32_t SUSP          : 1; // /*!< Channel suspend                                */
		uint32_t _reserved3    : 5;
		uint32_t TCIE          : 1; // /*!< Transfer complete interrupt enable             */
		uint32_t HTIE          : 1; // /*!< Half transfer complete interrupt enable        */
		uint32_t DTEIE         : 1; // /*!< Data transfer error interrupt enable           */
		uint32_t ULEIE         : 1; // /*!< Update linked-list item error interrupt enable */
		uint32_t USEIE         : 1; // /*!< User setting error interrupt enable            */
		uint32_t SUSPIE        : 1; // /*!< Completed suspension interrupt enable          */
		uint32_t TOIE          : 1; // /*!< Trigger overrun interrupt enable               */
		uint32_t _reserved15   : 1;
		uint32_t LSM           : 1; // /*!< Link step mode                                 */
		uint32_t LAP           : 1; // /*!< Linked-list allocated port                     */
		uint32_t _reserved18   : 4;
		uint32_t PRIO          : 2; // /*!< Priority level                                 */
		uint32_t _reserved24   : 8;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_dma,ccr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_dma,ccr),bits);

typedef union {
	struct {
		uint32_t SDW_LOG2      : 2; // /*!< Binary logarithm of the source data width of a burst                    */
		uint32_t _reserved2    : 1;
		uint32_t SINC          : 1; // /*!< Source incrementing burst                                               */
		uint32_t SBL_1         : 6; // /*!< Source burst length minus 1                                             */
		uint32_t _reserved10   : 1;
		uint32_t PAM           : 2; // /*!< Padding / alignment mode                                                */
		uint32_t SBX           : 1; // /*!< Source byte exchange within the unaligned half-word of each source word */
		uint32_t SAP           : 1; // /*!< Source allocated port                                                   */
		uint32_t _reserved15   : 1;
		uint32_t DDW_LOG2      : 2; // /*!< Binary logarithm of the destination data width of a burst               */
		uint32_t _reserved18   : 1;
		uint32_t DINC          : 1; // /*!< Destination incrementing burst                                          */
		uint32_t DBL_1         : 6; // /*!< Destination burst length minus 1                                        */
		uint32_t DBX           : 1; // /*!< Destination byte exchange                                               */
		uint32_t DHX           : 1; // /*!< Destination half-word exchange                                          */
		uint32_t _reserved28   : 2;
		uint32_t DAP           : 1; // /*!< Destination allocated port                                              */
		uint32_t _reserved31   : 1;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_dma,ctr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_dma,ctr1),bits);

typedef union {
	struct {
		uint32_t REQSEL        : 8; // /*!< DMA hardware request selection */
		uint32_t _reserved8    : 1;
		uint32_t SWREQ         : 1; // /*!< Software request               */
		uint32_t DREQ          : 1; // /*!< Destination hardware request   */
		uint32_t BREQ          : 1; // /*!< Block hardware request         */
		uint32_t PFREQ         : 1; // /*!< Block hardware request */
		uint32_t _reserved13   : 1;
		uint32_t TRIGM         : 2; // /*!< Trigger mode                   */
		uint32_t TRIGSEL       : 6; // /*!< Trigger event input selection  */
		uint32_t _reserved22   : 2;
		uint32_t TRIGPOL       : 2; // /*!< Trigger event polarity         */
		uint32_t _reserved26   : 4;
		uint32_t TCEM          : 2; // /*!< Transfer complete event mode   */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_dma,ctr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_dma,ctr2),bits);

typedef union {
	struct {
		uint32_t BNDT          :16; // /*!< Block number of data bytes to transfer from the source */
		uint32_t BRC           :11; // /*!< Block repeat counter                                   */
		uint32_t _reserved27   : 1;
		uint32_t SDEC          : 1; // /*!< Source address decrement                               */
		uint32_t DDEC          : 1; // /*!< Destination address decrement                          */
		uint32_t BRSDEC        : 1; // /*!< Block repeat source address decrement                  */
		uint32_t BRDDEC        : 1; // /*!< Block repeat destination address decrement             */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_dma,cbr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_dma,cbr1),bits);

typedef union {
	struct {
		uint32_t SA            :32; // /*!< Source Address */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_dma,csar);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_dma,csar),bits);

typedef union {
	struct {
		uint32_t DA            :32; // /*!< Destination address */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_dma,cdar);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_dma,cdar),bits);

typedef union {
	struct {
		uint32_t SAO           :13; // /*!< Source address offset increment      */
		uint32_t _reserved13   : 3;
		uint32_t DAO           :13; // /*!< Destination address offset increment */
		uint32_t _reserved29   : 3;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_dma,ctr3);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_dma,ctr3),bits);

typedef union {
	struct {
		uint32_t BRSAO         :16; // /*!< Block repeated source address offset      */
		uint32_t BRDAO         :16; // /*!< Block repeated destination address offset */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_dma,cbr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_dma,cbr2),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 2;
		uint32_t LA            :14; // /*!< Pointer to the next linked-list data structure */
		uint32_t ULL           : 1; // /*!< Update link address register from memory       */
		uint32_t _reserved17   : 8;
		uint32_t UB2           : 1; // /*!< Update block register 2 from memory            */
		uint32_t UT3           : 1; // /*!< Update transfer register 3 from SRAM           */
		uint32_t UDA           : 1; // /*!< Update destination address register from SRAM  */
		uint32_t USA           : 1; // /*!< Update source address register from SRAM       */
		uint32_t UB1           : 1; // /*!< Update block register 1 from SRAM              */
		uint32_t UT2           : 1; // /*!< Update transfer register 2 from SRAM           */
		uint32_t UT1           : 1; // /*!< Update transfer register 1 from SRAM           */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_dma,cllr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_dma,cllr),bits);

static const stm32_reginfo_t stm32_h503_dma_reginfo[RI_END] =
{
	[RI_PRIVCFGR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x000000FF, .mask = 0x000000FF }, /* mask = 0b00000000000000000000000011111111 */
	[RI_MISR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000000FF }, /* mask = 0b00000000000000000000000011111111 */
	[RI_CLBAR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0xFFFF0000, .mask = 0xFFFF0000 }, /* mask = 0b11111111111111110000000000000000 */
	[RI_CFCR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00007F00 }, /* mask = 0b00000000000000000111111100000000 */
	[RI_CSR            ] = { .reset_val = 0x00000001, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00FF7F01 }, /* mask = 0b00000000111111110111111100000001 */
	[RI_CCR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00C37C06, .mask = 0x00C37F07 }, /* mask = 0b00000000110000110111111100000111 */
	[RI_CTR1           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x4FF07BF0, .mask = 0x4FFB7BFB }, /* mask = 0b01001111111110110111101111111011 */
	[RI_CTR2           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0xC33FDEFF, .mask = 0xC33FDEFF }, /* mask = 0b11000011001111111101111011111111 */
	[RI_CBR1           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0xF7FF0000, .mask = 0xF7FFFFFF }, /* mask = 0b11110111111111111111111111111111 */
	[RI_CSAR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_CDAR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_CTR3           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x1FFF1FFF, .mask = 0x1FFF1FFF }, /* mask = 0b00011111111111110001111111111111 */
	[RI_CBR2           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0xFFFFFFFF, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_CLLR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0xFE01FFFC, .mask = 0xFE01FFFC }, /* mask = 0b11111110000000011111111111111100 */
};

typedef union {
	struct {
		uint32_t _reserved0x0;
		REGDEF_NAME(h503_dma,privcfgr) PRIVCFGR;
		uint32_t _reserved0x8;
		REGDEF_NAME(h503_dma,misr) MISR;
		uint32_t _reserved0x10[16];
		REGDEF_NAME(h503_dma,clbar) CLBAR;
		uint32_t _reserved0x54[ 2];
		REGDEF_NAME(h503_dma,cfcr) CFCR;
		REGDEF_NAME(h503_dma,csr) CSR;
		REGDEF_NAME(h503_dma,ccr) CCR;
		uint32_t _reserved0x68[10];
		REGDEF_NAME(h503_dma,ctr1) CTR1;
		REGDEF_NAME(h503_dma,ctr2) CTR2;
		REGDEF_NAME(h503_dma,cbr1) CBR1;
		REGDEF_NAME(h503_dma,csar) CSAR;
		REGDEF_NAME(h503_dma,cdar) CDAR;
		REGDEF_NAME(h503_dma,ctr3) CTR3;
		REGDEF_NAME(h503_dma,cbr2) CBR2;
		uint32_t _reserved0xAC[ 8];
		REGDEF_NAME(h503_dma,cllr) CLLR;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END];
}  REGDEF_NAME(h503,dma);
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(h503,dma)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,dma), PRIVCFGR) != 4, "Offset mismatch for PRIVCFGR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,dma), MISR) != 12, "Offset mismatch for MISR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,dma), CLBAR) != 80, "Offset mismatch for CLBAR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,dma), CFCR) != 92, "Offset mismatch for CFCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,dma), CSR) != 96, "Offset mismatch for CSR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,dma), CCR) != 100, "Offset mismatch for CCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,dma), CTR1) != 144, "Offset mismatch for CTR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,dma), CTR2) != 148, "Offset mismatch for CTR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,dma), CBR1) != 152, "Offset mismatch for CBR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,dma), CSAR) != 156, "Offset mismatch for CSAR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,dma), CDAR) != 160, "Offset mismatch for CDAR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,dma), CTR3) != 164, "Offset mismatch for CTR3");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,dma), CBR2) != 168, "Offset mismatch for CBR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,dma), CLLR) != 204, "Offset mismatch for CLLR");
